Autodesk.Revit.DB.ExportLinetypeInfo.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ExportLinetypeInfo.DestinationLinetypeName
The destination linetype name (the name of the linetype in the exported format).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.ExportLinetypeInfo.#ctor(System.String)
Constructs a new ExportLinetypeInfo using the destination linetype name as input.
destinationLinetypeName:
The destination line type name (the name of the linetype in the exported format).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.ExportLinetypeInfo.#ctor
Constructs a new default ExportLinetypeInfo.
Since:
2014

Autodesk.Revit.DB.ExportLinetypeInfo.#ctor(Autodesk.Revit.DB.ExportLinetypeInfo)
Constructs a new copy of the input ExportLinetypeInfo object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.ExportLinetypeInfo
A value used to represent the info stored in the Autodesk.Revit.DB.ExportLinetypeTable.
Since:
2014